"""
1. Вы с друзьями/приятелями/родственниками/корешами устраиваете посиделки.
На вашу долю выпала не самая простая задача - нужно разделить главное блюдо 
вечера между всеми гостями.
Создать две переменные food_name и number_of_people.
В food_name сохраните название вашей любимой вкуснятины, 
в number_of_people сохраните количество гостей на вашей вечеринке.

Примечание:
достаточно прямо в коде программы указать значения переменных.

Задание: 
Выведите в консоль сообщение о том, какая часть от общего блюда 
досталась каждому гостю.
Замените комментарии в коде ниже и запустите программу!)
"""

# Код:
food_name = "Хачапури"  # тут вводим название вкусняхи в виде строки
number_of_people = 3  # тут количество гостей в виде числа

print("Главное блюдо дня:", food_name) 
print("Каждому гостю досталось по 1/", number_of_people, "от вкусняхи!")
print("Они смотрят голодными глазами и не очень похоже что наелись")


# Код:
print("Вы идёте по лесу и замечаете шуршание в кустах...")
print("Вы бросате покебол в кусты в надежде поймать шуршащего там покемона...")
print("Похоже это удача! Вы кого-то поймали!")
pokemon_name = input("Что это за покемон???\n")
print("Вы поймали" + pokemon_name + "!!! \n Вот это удача!")
print(f"Вы поймали {pokemon_name} !!! \n Вот это удача!")

# Вы поймали Пикачу!!1 Вот это удача! - вывод должен быть примерно таким
